// /**
//
// Copyright (c) 2015 - 2017, Intel Corporation. All rights reserved.<BR>
// This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution. The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// Module Name:
//
// SouthBridge.uni
//
// Abstract:
//
// String definitions for SouthBridge
//
//
// **/

#string STR_PCIE_IP_CONFIG_TITLE                      #language en-US "PCIE IP Configuration"
#string STR_PCIE_IP_CONFIG_HELP                       #language en-US "PCIE IP Configuration"   
                                                      
#string STR_BIFURCATION0_PROMPT                       #language en-US "Bifurcation PCIE0"
#string STR_BIFURCATION1_PROMPT                       #language en-US "Bifurcation PCIE1"
#string STR_BIFURCATION_HELP                          #language en-US "Select and force Root Complex Bifurcation Configuration regardless board or trident detection"
#string STR_X8                                        #language en-US "x8"
#string STR_X4X4                                      #language en-US "x4x4"
#string STR_X4X2X2                                    #language en-US "x4x2x2"
#string STR_X2X2X4                                    #language en-US "x2x2x4"
#string STR_X2X2X2X2                                  #language en-US "x2x2x2x2"
                                                
#string STR_HOTPLUG_PROMPT                            #language en-US "Hot Plug support"਍ഀ
#string STR_HOTPLUG_HELP                              #language en-US "control Root Ports reporting of Hot Plug events"਍ഀ�

#string STR_PCIE_ROOTPORT_TITLE                       #language en-US "PCIE Root Port Configuration"
#string STR_PCIE_ROOTPORT_HELP                        #language en-US "PCIE Root Port Configuration"
                                                      
// Denverton AptioV Override Start - EIP#305575 

#string STR_PCH_PCIERP_PROMPT                        #language en-US  "PCI Express Root Port Enable"
#string STR_PCH_PCIERP_HELP                          #language en-US  "Control the PCI Express Root Port."

#string STR_PCH_PCIE_RBUS_PROMPT                     #language en-US "Extra Bus Reserved"
#string STR_PCH_PCIE_RBUS_HELP                       #language en-US "Extra Bus Reserved for bridges behind this Root Bridge."

#string STR_PCH_PCIE_RMEM_PROMPT                     #language en-US "Reseved Memory"
#string STR_PCH_PCIE_RMEM_HELP                       #language en-US "Reserved Memory and Prefetchable Memory (in MB) Range for this Root Bridge."

#string STR_PCH_PCIE_PF_RMEM_PROMPT                  #language en-US "Prefetchable Memory"
#string STR_PCH_PCIE_PF_RMEM_HELP                    #language en-US "Prefetchable Memory (in MB) for this Root Bridge."

#string STR_PCH_PCIE_RMEM_ALIG_PROMPT                #language en-US "Reseved Memory Alignment"
#string STR_PCH_PCIE_RMEM_ALIG_HELP                  #language en-US "Reseved Memory Alignment (0 - 31 bits)"

#string STR_PCH_PCIE_PF_RMEM_ALIG_PROMPT             #language en-US "Prefetchable Memory Alignment"
#string STR_PCH_PCIE_PF_RMEM_ALIG_HELP               #language en-US "Prefetchable Memory Alignment (0 - 31 bits)"

#string STR_PCH_PCIE_RVIO_PROMPT                    #language en-US "Reserved I/O"
#string STR_PCH_PCIE_RVIO_HELP                       #language en-US "Reserved I/O (4K/8K/12K/16K/20K) Range for this Root Bridge."

                                    
#string STR_PCIE_ROOTPORT0_TITLE                      #language en-US "Root Port 0"
#string STR_PCIE_ROOTPORT1_TITLE                      #language en-US "Root Port 1"
#string STR_PCIE_ROOTPORT2_TITLE                      #language en-US "Root Port 2"
#string STR_PCIE_ROOTPORT3_TITLE                      #language en-US "Root Port 3"
#string STR_PCIE_ROOTPORT4_TITLE                      #language en-US "Root Port 4"
#string STR_PCIE_ROOTPORT5_TITLE                      #language en-US "Root Port 5"
#string STR_PCIE_ROOTPORT6_TITLE                      #language en-US "Root Port 6"
#string STR_PCIE_ROOTPORT7_TITLE                      #language en-US "Root Port 7"
#string STR_PCIE_ROOTPORT_TITLE_HELP                  #language en-US "Configuration of PCI Express Root Port" 
// Denverton AptioV Override End - EIP#305575 
                                                     
//Root Port Setup Options                             
#string STR_ROOTPORT_LINK_SPEED_PROMPT                #language en-US "Link Speed"
#string STR_ROOTPORT_LINK_SPEED_HELP                  #language en-US "Select upper limit on link operational speed for PCI Express RootPort."
#string STR_RP_GEN1                                   #language en-US "Gen1"
#string STR_RP_GEN2                                   #language en-US "Gen2"
#string STR_RP_GEN3                                   #language en-US "Gen3"
                                                      
#string STR_ROOTPORT_CLOCK_GATING_PROMPT              #language en-US "Clock Gating"
#string STR_ROOTPORT_CLOCK_GATING_HELP                #language en-US "Enable / Disable Clock Gating for PCI Express RootPort."
                                                      
#string STR_ROOTPORT_MAX_PAYLOAD_PROMPT               #language en-US "Max Payload"
#string STR_ROOTPORT_MAX_PAYLOAD_HELP                 #language en-US "Set Maximum Payload of PCI Express RootPort or allow BIOS to select the value"
#string STR_AUTO                                      #language en-US "Auto"
#string STR_MP128                                     #language en-US "128 Bytes"
#string STR_MP256                                     #language en-US "256 Bytes"
#string STR_MP512                                     #language en-US "512 Bytes"
#string STR_MP1024                                    #language en-US "1024 Bytes"
#string STR_MP2048                                    #language en-US "2048 Bytes"
#string STR_MP4096                                    #language en-US "4096 Bytes"
                                                      
#string STR_ROOTPORT_MAX_READ_REQUEST_PROMPT          #language en-US "Max Read Request"
#string STR_ROOTPORT_MAX_READ_REQUEST_HELP            #language en-US "Set Maximum Read Request of PCI Express RootPort or allow BIOS to select the value"
                                                      
#string STR_ROOTPORT_EXT_TAG_FIELD_PROMPT             #language en-US "Extended Tag"
#string STR_ROOTPORT_EXT_TAG_FIELD_HELP               #language en-US "If Enabled allows Device to use 8-bit Tag field as a requester"
                                                      
#string STR_ROOTPORT_RELAXED_ORDERING_PROMPT          #language en-US "Relaxed Ordering"
#string STR_ROOTPORT_RELAXED_ORDERING_HELP            #language en-US "Enables or Disables PCI Express Device Relaxed Ordering."
                                                      
#string STR_ROOTPORT_EXT_SYNC_PROMPT                  #language en-US "Extended Synch"
#string STR_ROOTPORT_EXT_SYNC_HELP                    #language en-US "If Enabled allows generation of Extended Synchronization patterns"
                                                      
#string STR_ROOTPORT_DEEMPHASIS_PROMPT                #language en-US "De-Emphasis"
#string STR_ROOTPORT_DEEMPHASIS_HELP                  #language en-US "When the link is operating at 5 Gb/s speed, this bit selects the level of de-emphasis for an Downstream Port"
#string STR_3_5                                       #language en-US "-3.5 dB"
#string STR_6_0                                       #language en-US "-6.0 dB"

#string STR_BWR_PCIERPLOCK_SUPPORT                    #language en-US "RW - Lock"
#string STR_LOCK_SUPPORT_HELP                         #language en-US "Root Port lock option"

#string STR_BWR_PCIE_STOP_SCREAM_SUPPORT              #language en-US "Stop and Scream"
#string STR_STOP_SCREAM_SUPPORT_HELP                  #language en-US "Stop and Scream option"

#string STR_ROOTPORT_LANE_REVERSAL_PROMPT             #language en-US "Lane Reversal"
#string STR_ROOTPORT_LANE_REVERSAL_HELP               #language en-US "Enable / Disable Dynamic Lane Reversal on PCI Express RootPort"
                                                      
#string STR_ROOTPORT_REPLAY_TIMER_TIMEOUT_PROMPT      #language en-US "Replay Timer Timeout"
#string STR_ROOTPORT_REPLAY_TIMER_TIMEOUT_HELP        #language en-US "Number of [us] after which a replay will be initiated if not new TLPs have ACKed"
                                                      
#string STR_ROOTPORT_COMPLETION_TIMEOUT_PROMPT        #language en-US "Completion Timeout Disabled"
#string STR_ROOTPORT_COMPLETION_TIMEOUT_HELP          #language en-US "Enable / Disable Completion Timeout"

#string STR_ROOTPORT_COMPLETION_TIMEOUT_RANGE_PROMPT  #language en-US "Completion Timeout Range"
#string STR_ROOTPORT_COMPLETION_TIMEOUT_RANGE_HELP    #language en-US "This field indicates the Completion Timeout Range value"
#string STR_DEFAULT                                   #language en-US "Default"
#string STR_50US_50MS                                 #language en-US "50us to 50ms"
#string STR_50US_100US                                #language en-US "50us to 100us"
#string STR_1MS_10MS                                  #language en-US "1ms to 10ms"
#string STR_16MS_55MS                                 #language en-US "16ms to 55ms"
#string STR_65MS_210MS                                #language en-US "65ms to 210ms"
#string STR_260MS_900MS                               #language en-US "260ms to 900ms"
#string STR_1S_3_5S                                   #language en-US "1s to 3.5s"
#string STR_4S_13S                                    #language en-US "4s to 13s"  #string STR_17S_64S                                   #language en-US "17s to 64s"  


#string STR_PCH_PCIE_COMPLIANCETEST_PROMPT      #language en-US "Compliance Test Mode"
#string STR_PCH_PCIE_COMPLIANCETEST_HELP        #language en-US "Enable when using Compliance Load Board"

#string STR_PCIE_LSD_PROMPT                     #language en-US  "Surprise link"
#string STR_PCIE_LSD_HELP                       #language en-US  "Activate surprise link"

// PCIE lanes
#string STR_VFR_FORMID_LANES_PCIE               #language en-US "Topologies for PCIE lane by lane"
#string STR_VFR_FORMID_LANES_PCIE_HELP          #language en-US "Lane by lane the conectors are defined"
#string STR_PCIE_TOPOLOGY0                      #language en-US "Topology"
#string STR_PCIE_TOPOLOGY1                      #language en-US "Topology"
#string STR_PCIE_TOPOLOGY2                      #language en-US "Topology"
#string STR_PCIE_TOPOLOGY3                      #language en-US "Topology"
#string STR_PCIE_TOPOLOGY4                      #language en-US "Topology"
#string STR_PCIE_TOPOLOGY5                      #language en-US "Topology"
#string STR_PCIE_TOPOLOGY6                      #language en-US "Topology"
#string STR_PCIE_TOPOLOGY7                      #language en-US "Topology"
#string STR_PCIE_TOPOLOGY8                      #language en-US "Topology"
#string STR_PCIE_TOPOLOGY9                      #language en-US "Topology"
#string STR_PCIE_TOPOLOGY10                     #language en-US "Topology"
#string STR_PCIE_TOPOLOGY11                     #language en-US "Topology"
#string STR_PCIE_TOPOLOGY12                     #language en-US "Topology"
#string STR_PCIE_TOPOLOGY13                     #language en-US "Topology"
#string STR_PCIE_TOPOLOGY14                     #language en-US "Topology"
#string STR_PCIE_TOPOLOGY15                     #language en-US "Topology"
#string STR_PCIE_TOPOLOGY_HELP                  #language en-US "Identify PCIE Topology:x1, x4, sata express or M2"
#string STR_PCIE_UNKNOWN_TOPOLOGY_STRING        #language en-US "Unknown"
#string STR_PCIE_X1_STRING                      #language en-US "x1"
#string STR_PCIE_X4_STRING                      #language en-US "x4"
#string STR_PCIE_SATA3_STRING                   #language en-US "Sata Express"
#string STR_PCIE_M2X1_STRING                    #language en-US "M2x1"
#string STR_PCIE_M2X4_STRING                    #language en-US "M2x4"

